app/controllers/posts_controller.rb

SELECT "authors".* FROM "authors"
SELECT "posts".* FROM "posts" WHERE (created_at >='2016-01-27 00:00:00.000000')
---
  def index
     @author = Author.all

     if !params[:author].blank?
       @posts = Post.by_author(params[:author])
     elsif !params[:date].blank?
       if params[:date] == "Today"
         @posts = Post.from_today(params[:date])
       else
         @posts = Post.old_news(params[:date])
       end
     else
       @posts = Post.all